spec/fixtures/files/stripe/customer.json

{
  "id": "cus_JfY9Kidn1h4KiY",
  "object": "customer",
  "address": null,
  "balance": 0,
  "created": 1623666619,
  "currency": "eur",
  "default_source": null,
  "delinquent": false,
  "description": null,
  "discount": null,
  "email": "ksjdf@example.com",
  "invoice_prefix": "72D03F35",
  "invoice_settings": {"custom_fields":null,"default_payment_method":"pm_1J2D3eHwuhGySQCd358rMC7R","footer":null},
  "livemode": false,
  "metadata": {},
  "name": null,
  "next_invoice_sequence": 2,
  "phone": null,
  "preferred_locales": [

  ],
  "shipping": null,
  "sources": {"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/customers/cus_JfY9Kidn1h4KiY/sources"},
  "subscriptions": {"object":"list","data":[{"id":"sub_JfYAJsKMCumBzr","object":"subscription","application_fee_percent":null,"billing_cycle_anchor":1623666621,"billing_thresholds":null,"cancel_at":null,"cancel_at_period_end":false,"canceled_at":null,"collection_method":"charge_automatically","created":1623666621,"current_period_end":1626258621,"current_period_start":1623666621,"customer":"cus_JfY9Kidn1h4KiY","days_until_due":null,"default_payment_method":null,"default_source":null,"default_tax_rates":[],"discount":null,"ended_at":null,"items":{"object":"list","data":[{"id":"si_JfYAIlmeIU9y6a","object":"subscription_item","billing_thresholds":null,"created":1623666622,"metadata":{},"plan":{"id":"offsetting_subscription_2021_eur_7_00","object":"plan","active":true,"aggregate_usage":null,"amount":700,"amount_decimal":"700","billing_scheme":"per_unit","created":1623416106,"currency":"eur","interval":"month","interval_count":1,"livemode":false,"metadata":{"co2e":"1167"},"nickname":null,"product":"offsetting_subscription_2021","tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"price":{"id":"offsetting_subscription_2021_eur_7_00","object":"price","active":true,"billing_scheme":"per_unit","created":1623416106,"currency":"eur","livemode":false,"lookup_key":null,"metadata":{"co2e":"1167"},"nickname":null,"product":"offsetting_subscription_2021","recurring":{"aggregate_usage":null,"interval":"month","interval_count":1,"trial_period_days":null,"usage_type":"licensed"},"tiers_mode":null,"transform_quantity":null,"type":"recurring","unit_amount":700,"unit_amount_decimal":"700"},"quantity":1,"subscription":"sub_JfYAJsKMCumBzr","tax_rates":[]}],"has_more":false,"total_count":1,"url":"/v1/subscription_items?subscription=sub_JfYAJsKMCumBzr"},"latest_invoice":"in_1J2D3hHwuhGySQCdf5x2g990","livemode":false,"metadata":{},"next_pending_invoice_item_invoice":null,"pause_collection":null,"pending_invoice_item_interval":null,"pending_setup_intent":null,"pending_update":null,"plan":{"id":"offsetting_subscription_2021_eur_7_00","object":"plan","active":true,"aggregate_usage":null,"amount":700,"amount_decimal":"700","billing_scheme":"per_unit","created":1623416106,"currency":"eur","interval":"month","interval_count":1,"livemode":false,"metadata":{"co2e":"1167"},"nickname":null,"product":"offsetting_subscription_2021","tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"schedule":null,"start_date":1623666621,"status":"active","transfer_data":null,"trial_end":null,"trial_start":null}],"has_more":false,"total_count":1,"url":"/v1/customers/cus_JfY9Kidn1h4KiY/subscriptions"},
  "tax_exempt": "none"
}
